# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
# #################################################################################
# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################
#
# list comprehension
#
# 1)є строка:
# greeting = 'Hello, world'
# записати кожний символ як окремий елемент списку і зробити його заглавним:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
#
# 2) з диапозону від 0-50 записати тільки не парні числа при цьому піднести їх до квадрату
# приклад:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]
#
# function
#
# - створити функцію яка виводить ліст
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
# - створити функцію яка повертає найбільше число з ліста
# - створити функцію яка повертає найменьше число з ліста
# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
#
#
#
#
# ################################################################################################
# 1)Дан list:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - знайти мін число
#   - видалити усі дублікати
#   - замінити кожне 4-те значення на 'X'
# 2) вивести на екран пустий квадрат з "*" сторона якого вказана як агрумент функції
# 3) вывести табличку множення за допомогою цикла while
# 4) переробити це завдання під меню


# # str1
# st = 'as 23 fdfdg544'
# print(','.join(num for num in st if num.isdigit()))
#
# # str2
# s = 'as 23 fdfdg544 34'
# print(','.join(''.join(number_split if number_split.isdigit() else ' ' for number_split in s).split()))
#
# # list1
# greeting = 'Hello, world'
# print([letter.upper() for letter in greeting])
#
# # list2
# print([i ** 2 for i in range(50) if i % 2])
#
#
# # function
# #  створити функцію яка виводить ліст
#
# def show(some_list):
#     for i in some_list:
#         print(i)
#
# # - створити функцію яка приймає три числа та виводить та повертає найбільше.
#
# def max_of_number(a, b, c):
#     com = max(a, b, c)
#     print(com)
#     return com

# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше

# def max_and_min(*args):
#     maxi = max(args)
#     mini = min(args)
#     print(maxi)
#     return mini

# - створити функцію яка повертає найбільше число з ліста

# - створити функцію яка повертає найменьше число з ліста

# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.

# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.

# Табличка множення
# def multi():
#     size = 9
#     i = 1
#     while i <= size:
#         j = 1
#         while j <= size:
#             res = i * j
#             # print(' ' if res // 10 else '  ', end='')
#             # print(res, end='')
#             print(f'{res:4}', end='')
#             j += 1
#         print()
#         i += 1

# s1 = int(10)
# for i in range(1, s1 + 1):
#     print(*range(i, i * s1 + 1, i), sep='\t')

# Меню
numbers = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]


def menu():
    while True:
        print('1. Знайти мін число')
        print('2. Видалити усі дублікати')
        print('3. Замінити кожне 4-те значення на `X`')
        print('4. EXIT')
        choose = input('Choose one item: ')
        if choose == '1':
            def min_num():

                arr = numbers.copy()

                print(min(arr))

        elif choose == '2':
            def dublicate():

                arrr = numbers.copy()

                print(list(set(arrr)))

        elif choose == '3':
            def to_x():

                arrrr = numbers.copy()

                print(['X' if not (i + 1) % 4 else item for i, item in enumerate(arrrr)])

        elif choose == '4':
            break
